import numpy as np

a = np.array([1,23,4],dtype=np.float32)
print(a.dtype)

#定义一个二维array（矩阵）
print('-----------------------------')
b = np.array([[1,2,3],
                      [2,3,4]])
print(b)

#生成一个全部为0的矩阵
print('----------------------------------')
c = np.zeros((3,4))  #括号输入想要定义的维度，几行几列的
print(c)

#生成一个全部为1的矩阵
print('-----------------------------------')
d = np.ones((3,4),dtype=np.int16)
print(d)

#生成一个空矩阵
print('-----------------------------------')
e = np.empty((3,4))
print(e)

#生成一个有序的数列或矩阵
print('--------------------------------------')
f = np.arange(10,20,2)                #括号中参数依次代表起始值、终止值、步长
print(f)

#生成一个数列，再重新定义他的shape
print('----------------------------------------')
g = np.arange(12).reshape((3,4))
print(g)

#生成一个线段
print('------------------------------------------')
h = np.linspace(1,10,5)             #括号中的参数依次代表：起始值、结束值、生成的线段数
print(h)

#生成线段以后更改shape
print('-----------------------------------------------')
j = np.linspace(1,20,6).reshape((2,3))
print(j)